Revit 2024 API
DocumentSavingAsEventArgs.IsSavingAsCentralFile Property
 Indicates whether the document is to be saved as central file.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public bool IsSavingAsCentralFile { get; }
Visual Basic
Public ReadOnly Property IsSavingAsCentralFile As Boolean
	Get
Visual C++
public:
property bool IsSavingAsCentralFile {
	bool get ();
}
See Also
DocumentSavingAsEventArgs Class
Autodesk.Revit.DB.Events Namespace